package com.atguigu.charpter09

import scala.collection.immutable
import scala.io.Source
import scala.util.Try

object $$$_Home03 {
  /**
   * 3、获取每个省份农产品最多的三个农贸市场
   */
  def main(args: Array[String]): Unit = {
    //1:读取数据转换格式
    val list1: List[String] = Source.fromFile("C:\\Users\\Admin\\Desktop\\product.txt", "utf-8").getLines().toList
   // println(list1)

    //2:切割
    //香菜	2.80	2018/1/1	山西汾阳市晋阳农副产品批发市场	山西	汾阳
    val list: List[(String, String, String)] = list1.map(x => {
      val arr: Array[String] = x.split("\t")
      val productSum = arr.head
      val province = Try(arr(4)).getOrElse("") //省份
      val shichang = Try(arr(3)).getOrElse("") //市场
      (productSum, province, shichang)
    })
   //list.foreach(println(_))

    /**
     * (胡萝卜,山东,山东德州农业蔬菜局)
     * (土豆,山东,山东德州农业蔬菜局)
     * (生姜,山东,山东德州农业蔬菜局)
     * (莲藕,山东,山东德州农业蔬菜局)
     * (香菇,山东,山东德州农业蔬菜局)
     * (洋白菜,山东,山东德州农业蔬菜局)
     * (大白菜,山东,山东德州农业蔬菜局)
     * (油菜,山东,山东德州农业蔬菜局)
     * (菠菜,山东,山东德州农业蔬菜局)
     * (菜花,山东,山东德州农业蔬菜局)
     * (西兰花,山东,山东德州农业蔬菜局)
     * (生菜,山东,山东德州农业蔬菜局)
     * (芹菜,山东,山东德州农业蔬菜局)
     * (西洋芹,山东,山东德州农业蔬菜局)
     * (香菜,山东,山东德州农业蔬菜局)
     * (茼蒿,山东,山东德州农业蔬菜局)
     * (大葱,山东,山东德州农业蔬菜局)
     * (葱头,山东,山东德州农业蔬菜局)
     * (大蒜,山东,山东德州农业蔬菜局)
     * (蒜苔,山东,山东德州农业蔬菜局)
     * (蒜苗,山东,山东德州农业蔬菜局)
     * (韭菜,山东,山东德州农业蔬菜局)
     * (茴香,山东,山东德州农业蔬菜局)
     * (尖椒,山东,山东德州农业蔬菜局)
     * (青椒,山东,山东德州农业蔬菜局)
     * (圆茄子,山东,山东德州农业蔬菜局)
     * (长茄子,山东,山东德州农业蔬菜局)
     * (西红柿,山东,山东德州农业蔬菜局)
     * (黄瓜,山东,山东德州农业蔬菜局)
     * (南瓜,山东,山东德州农业蔬菜局)
     * (西葫芦,山东,山东德州农业蔬菜局)
     * (白萝卜,山东,山东德州农业蔬菜局)
     */

    //3:根据市场分组
    val map: Map[String, List[(String, String, String)]] = list.groupBy(x => x._3)
    map.foreach(println(_))

    //4:求每个市场的农副品的个数
    val tuples: immutable.Iterable[(String, Int, List[String])] = map.map(x => {
      val shicheng = x._1 //市场
      val geshu = x._1.size //个数
      val privince = x._2.map(y => y._2).distinct //省份
      (shicheng, geshu, privince)
    })
   tuples.foreach(println(_))

    /**
     * (北京昌平区水屯农副产品批发市场,15,List(北京))
(安徽安庆市龙狮桥蔬菜副食品批发交易市场,19,List(安徽))
(辽宁阜新市瑞轩蔬菜农副产品综合批发市场,19,List(辽宁))
(山西大同振华蔬菜批发市场,12,List(山西))
(广东广州江南农副产品市场,12,List(广东))
(湖北省黄石市农副产品批发交易公司,16,List(湖北))
(山东济南市堤口路果品批发市场,14,List(山东))
(新疆石河子西部绿珠果蔬菜批发市场,16,List(北京))
(湖南常德甘露寺蔬菜批发市场,13,List(湖南))
(山东青岛平度市南村蔬菜批发市场,15,List(山东))
(山西临汾尧丰农副产品批发市场,14,List(山西))
(四川省江油仔猪批发市场,11,List(四川))
(天津金钟蔬菜批发市场,10,List(天津))
(北京八里桥农产品中心批发市场,14,List(北京))
(北京锦绣大地玉泉路粮油批发市场,15,List(北京))
....
     */

    //5:排序
       //转List格式
    val list2: List[(String, Int, List[String])] = tuples.toList
      //排序
    val list3: List[(String, Int, List[String])] = list2.sortBy(x => {
      x._2
    })
    println(list3)
     //反转
    val reverse: List[(String, Int, List[String])] = list3.reverse
    println(reverse)

    val map1: Map[List[String], List[(String, Int, List[String])]] = reverse.groupBy(x => {
      x._3
    })
    map1.foreach(println(_))

    val list4: List[(List[String], List[(String, Int, List[String])])] = map1.toList
    println("*"*100)
    list4.foreach(println(_))

    /**
     * (List(天津),List((天津西青区当城无公害农副产品批发市场,18,List(天津)), (天津南开区红旗农贸批发市场,13,List(天津)), (天津金钟蔬菜批发市场,10,List(天津)), (天津何庄子批发市场,9,List(天津))))
     * (List(上海),List((上海农产品中心批发市场有限公,14,List(上海))))
     * (List(湖南),List((湖南常德甘露寺蔬菜批发市场,13,List(湖南)), (长沙市马王堆批发市场,10,List(湖南))))
     * (List(新疆),List((新疆克拉玛依乌尔禾兵团农七师一三七团绿衡蔬菜瓜果批发市场,28,List(新疆)), (新疆乌鲁木齐北园春批发市场,13,List(新疆))))
     * (List(辽宁),List((辽宁阜新市瑞轩蔬菜农副产品综合批发市场,19,List(辽宁)), (辽宁鞍山宁远农产品批发市场,13,List(辽宁)), (大连水产品交易市场有限公司,13,List(辽宁)), (辽宁朝阳市果菜批发市场,11,List(辽宁)), (大连双兴批发市场,8,List(辽宁))))
     * (List(北京),List((新疆石河子西部绿珠果蔬菜批发市场,16,List(北京)), (北京锦绣大地玉泉路粮油批发市场,15,List(北京)), (北京昌平区水屯农副产品批发市场,15,List(北京)), (北京八里桥农产品中心批发市场,14,List(北京)), (北京朝阳区大洋路综合市场,12,List(北京)), (北京顺义石门蔬菜批发市场,12,List(北京))))
     * (List(吉林),List((长春蔬菜中心批发市场,10,List(吉林))))
     * (List(内蒙古),List((内蒙呼市食全食美股份有限公司石羊桥交易中,20,List(内蒙古)), (内蒙包头市场友谊蔬菜批发市场,14,List(内蒙古)), (呼和浩特市东瓦窑批发市场,12,List(内蒙古))))
     * (List(浙江),List((浙江嘉善浙北果蔬菜批发交易,13,List(浙江)), (浙江嘉兴蔬菜批发交易市场,12,List(浙江)), (浙江义乌农贸城,7,List(浙江))))
     * (List(黑龙江),List((黑龙江鹤岗市万圃源蔬菜有限责任公司,17,List(黑龙江))))
     * (List(陕西),List((陕西咸阳市新阳光农副产品批发市场,16,List(陕西)), (陕西泾阳县云阳蔬菜批发市场,13,List(陕西)), (陕西西部欣桥农产品物流中心,13,List(陕西))))
     * (List(广东),List((广东汕头农副产品批发中心,12,List(广东)), (广东广州江南农副产品市场,12,List(广东))))
     * (List(青海),List((西宁仁杰粮油批发市场有限公司,14,List(青海))))
     * (List(河南),List((河南郑州农产品物流配送中心,13,List(河南)), (河南安阳豫北蔬菜批发市场,12,List(河南))))
     * (List(广西),List((广西南宁市五里亭蔬菜批发市场,14,List(广西)), (广西柳州柳邕农副产品批发市场,14,List(广西)), (广西田阳县果蔬菜批发市场,12,List(广西))))
     * (List(宁夏),List((宁夏吴忠市利通区东郊果蔬批发市场,16,List(宁夏))))
     * (List(甘肃),List((甘肃酒泉春光农产品市场有限责任公司,17,List(甘肃)), (甘肃省武山县洛门蔬菜批发市场,14,List(甘肃)), (甘肃陇西县清吉洋芋批发市场,13,List(甘肃))))
     * (List(湖北),List((湖北省黄石市农副产品批发交易公司,16,List(湖北)), (湖北武汉白沙洲农副产品大市场,14,List(湖北)), (武汉市皇经堂批发市场,10,List(湖北))))
     * (List(江西),List((江西省永丰县农产品批发中心市场,15,List(江西))))
     * (List(山东),List((山东青岛平度市南村蔬菜批发市场,15,List(山东)), (山东青岛李沧区沧口蔬菜副食品,14,List(山东)), (山东济南市堤口路果品批发市场,14,List(山东)), (山东威海市农副产品批发市场,13,List(山东)), (山东青岛城阳蔬菜批发市场,12,List(山东)), (山东中国寿光农产品物流园,12,List(山东)), (山东威海水产品批发市场,11,List(山东)), (山东德州农业蔬菜局,9,List(山东)), (山东章丘批发市场,8,List(山东))))
     * (List(江苏),List((江苏省南京市惠民桥农副产品市场,15,List(江苏)), (江苏苏州南环桥农副产品批发市,14,List(江苏)), (江苏常州宣塘桥水产品交易市场,14,List(江苏)), (江苏宜兴蔬菜副食品批发市场,13,List(江苏)), (江苏凌家塘农副产品批发市场,13,List(江苏)), (江苏建湖县水产批发市场,11,List(江苏)), (江苏无锡朝阳市场,8,List(江苏))))
     * (List(福建),List((福建福鼎闽浙边界农贸中心市场,14,List(福建)), (福州市闽江蔬菜贸易中心,11,List(福建))))
     * (List(重庆),List((重庆江北区盘溪农贸市场,11,List(重庆))))
     * (List(山西),List((山西晋城市绿盛农工商实业有限公司农副产品批发市场,24,List(山西)), (山西呂梁市离石区马茂庄常青蔬菜瓜果综合市场,21,List(山西)), (山西太原市城东利民果菜批发市场,15,List(山西)), (山西汾阳市晋阳农副产品批发市场,15,List(山西)), (山西临汾尧丰农副产品批发市场,14,List(山西)), (山西晋城绿欣农产品批发市场,13,List(山西)), (太原市桥西农副产品批发市场,13,List(山西)), (山西长治市金鑫瓜果批发市场,13,List(山西)), (山西阳泉蔬菜瓜果批发市场,12,List(山西)), (山西大同振华蔬菜批发市场,12,List(山西))))
     * (List(四川),List((四川凉山州会东县堵格乡牲畜交易市场,17,List(四川)), (四川广安市邻水县农产品交易中心,15,List(四川)), (四川南充市桑园坝农产品批发市场,15,List(四川)), (四川西昌广平农副土特产品市场,14,List(四川)), (四川绵阳市高水蔬菜批发市场,13,List(四川)), (四川省江油仔猪批发市场,11,List(四川))))
     * (List(安徽),List((安徽安庆市龙狮桥蔬菜副食品批发交易市场,19,List(安徽)), (安徽马鞍山安民农副产品批发交易市场,17,List(安徽)), (安徽砀山农产品中心惠丰批发市场,15,List(安徽)), (安徽合肥周谷堆农产品批发市场,14,List(安徽)), (安徽亳州蔬菜批发市场,10,List(安徽))))
     * (List(),List((,0,List())))
     * (List(河北),List((河北邯郸（魏县）天仙果品农贸批发交易市场,20,List(河北)), (河北怀来县就西果菜批发市场有限责任公司,19,List(河北)), (河北乐亭县冀东果蔬批发市场,13,List(河北)), (河北秦皇岛海阳农副产品批发,13,List(河北)), (石家庄桥西批发市场,9,List(河北))))
     */

      //取前三
    val list5: List[(List[String], List[(String, Int, List[String])])] = list4.map(x => {
      val privince = x._1
      val qiansan = x._2.take(3)
      (privince, qiansan)
    })
    println("%%%%%555"*10)
    list5.foreach(println(_))

    /**
     * (List(天津),List((天津西青区当城无公害农副产品批发市场,18,List(天津)), (天津南开区红旗农贸批发市场,13,List(天津)), (天津金钟蔬菜批发市场,10,List(天津))))
     * (List(上海),List((上海农产品中心批发市场有限公,14,List(上海))))
     * (List(湖南),List((湖南常德甘露寺蔬菜批发市场,13,List(湖南)), (长沙市马王堆批发市场,10,List(湖南))))
     * (List(新疆),List((新疆克拉玛依乌尔禾兵团农七师一三七团绿衡蔬菜瓜果批发市场,28,List(新疆)), (新疆乌鲁木齐北园春批发市场,13,List(新疆))))
     * (List(辽宁),List((辽宁阜新市瑞轩蔬菜农副产品综合批发市场,19,List(辽宁)), (辽宁鞍山宁远农产品批发市场,13,List(辽宁)), (大连水产品交易市场有限公司,13,List(辽宁))))
     * (List(北京),List((新疆石河子西部绿珠果蔬菜批发市场,16,List(北京)), (北京锦绣大地玉泉路粮油批发市场,15,List(北京)), (北京昌平区水屯农副产品批发市场,15,List(北京))))
     * (List(吉林),List((长春蔬菜中心批发市场,10,List(吉林))))
     * (List(内蒙古),List((内蒙呼市食全食美股份有限公司石羊桥交易中,20,List(内蒙古)), (内蒙包头市场友谊蔬菜批发市场,14,List(内蒙古)), (呼和浩特市东瓦窑批发市场,12,List(内蒙古))))
     * (List(浙江),List((浙江嘉善浙北果蔬菜批发交易,13,List(浙江)), (浙江嘉兴蔬菜批发交易市场,12,List(浙江)), (浙江义乌农贸城,7,List(浙江))))
     * (List(黑龙江),List((黑龙江鹤岗市万圃源蔬菜有限责任公司,17,List(黑龙江))))
     * (List(陕西),List((陕西咸阳市新阳光农副产品批发市场,16,List(陕西)), (陕西泾阳县云阳蔬菜批发市场,13,List(陕西)), (陕西西部欣桥农产品物流中心,13,List(陕西))))
     * (List(广东),List((广东汕头农副产品批发中心,12,List(广东)), (广东广州江南农副产品市场,12,List(广东))))
     * (List(青海),List((西宁仁杰粮油批发市场有限公司,14,List(青海))))
     * (List(河南),List((河南郑州农产品物流配送中心,13,List(河南)), (河南安阳豫北蔬菜批发市场,12,List(河南))))
     * (List(广西),List((广西南宁市五里亭蔬菜批发市场,14,List(广西)), (广西柳州柳邕农副产品批发市场,14,List(广西)), (广西田阳县果蔬菜批发市场,12,List(广西))))
     * (List(宁夏),List((宁夏吴忠市利通区东郊果蔬批发市场,16,List(宁夏))))
     * (List(甘肃),List((甘肃酒泉春光农产品市场有限责任公司,17,List(甘肃)), (甘肃省武山县洛门蔬菜批发市场,14,List(甘肃)), (甘肃陇西县清吉洋芋批发市场,13,List(甘肃))))
     * (List(湖北),List((湖北省黄石市农副产品批发交易公司,16,List(湖北)), (湖北武汉白沙洲农副产品大市场,14,List(湖北)), (武汉市皇经堂批发市场,10,List(湖北))))
     * (List(江西),List((江西省永丰县农产品批发中心市场,15,List(江西))))
     * (List(山东),List((山东青岛平度市南村蔬菜批发市场,15,List(山东)), (山东青岛李沧区沧口蔬菜副食品,14,List(山东)), (山东济南市堤口路果品批发市场,14,List(山东))))
     * (List(江苏),List((江苏省南京市惠民桥农副产品市场,15,List(江苏)), (江苏苏州南环桥农副产品批发市,14,List(江苏)), (江苏常州宣塘桥水产品交易市场,14,List(江苏))))
     * (List(福建),List((福建福鼎闽浙边界农贸中心市场,14,List(福建)), (福州市闽江蔬菜贸易中心,11,List(福建))))
     * (List(重庆),List((重庆江北区盘溪农贸市场,11,List(重庆))))
     * (List(山西),List((山西晋城市绿盛农工商实业有限公司农副产品批发市场,24,List(山西)), (山西呂梁市离石区马茂庄常青蔬菜瓜果综合市场,21,List(山西)), (山西太原市城东利民果菜批发市场,15,List(山西))))
     * (List(四川),List((四川凉山州会东县堵格乡牲畜交易市场,17,List(四川)), (四川广安市邻水县农产品交易中心,15,List(四川)), (四川南充市桑园坝农产品批发市场,15,List(四川))))
     * (List(安徽),List((安徽安庆市龙狮桥蔬菜副食品批发交易市场,19,List(安徽)), (安徽马鞍山安民农副产品批发交易市场,17,List(安徽)), (安徽砀山农产品中心惠丰批发市场,15,List(安徽))))
     * (List(),List((,0,List())))
     * (List(河北),List((河北邯郸（魏县）天仙果品农贸批发交易市场,20,List(河北)), (河北怀来县就西果菜批发市场有限责任公司,19,List(河北)), (河北乐亭县冀东果蔬批发市场,13,List(河北))))
     */

    val list6: List[(List[String], List[String], List[Int])] = list5.map(x => {
      val shengfen = x._1
      val shicheng = x._2.map(y => {
        y._1
      })
      val geshu = x._2.map(y => {
        y._2
      })
      (shengfen, shicheng, geshu)
    })
    println("6666666666"*10)
    list6.foreach(println(_))

    /**
 (List(天津),List(天津西青区当城无公害农副产品批发市场, 天津南开区红旗农贸批发市场, 天津金钟蔬菜批发市场),List(18, 13, 10))
(List(上海),List(上海农产品中心批发市场有限公),List(14))
(List(湖南),List(湖南常德甘露寺蔬菜批发市场, 长沙市马王堆批发市场),List(13, 10))
(List(新疆),List(新疆克拉玛依乌尔禾兵团农七师一三七团绿衡蔬菜瓜果批发市场, 新疆乌鲁木齐北园春批发市场),List(28, 13))
(List(辽宁),List(辽宁阜新市瑞轩蔬菜农副产品综合批发市场, 辽宁鞍山宁远农产品批发市场, 大连水产品交易市场有限公司),List(19, 13, 13))
(List(北京),List(新疆石河子西部绿珠果蔬菜批发市场, 北京锦绣大地玉泉路粮油批发市场, 北京昌平区水屯农副产品批发市场),List(16, 15, 15))
(List(吉林),List(长春蔬菜中心批发市场),List(10))
(List(内蒙古),List(内蒙呼市食全食美股份有限公司石羊桥交易中, 内蒙包头市场友谊蔬菜批发市场, 呼和浩特市东瓦窑批发市场),List(20, 14, 12))
(List(浙江),List(浙江嘉善浙北果蔬菜批发交易, 浙江嘉兴蔬菜批发交易市场, 浙江义乌农贸城),List(13, 12, 7))
(List(黑龙江),List(黑龙江鹤岗市万圃源蔬菜有限责任公司),List(17))
(List(陕西),List(陕西咸阳市新阳光农副产品批发市场, 陕西泾阳县云阳蔬菜批发市场, 陕西西部欣桥农产品物流中心),List(16, 13, 13))
(List(广东),List(广东汕头农副产品批发中心, 广东广州江南农副产品市场),List(12, 12))
(List(青海),List(西宁仁杰粮油批发市场有限公司),List(14))
(List(河南),List(河南郑州农产品物流配送中心, 河南安阳豫北蔬菜批发市场),List(13, 12))
(List(广西),List(广西南宁市五里亭蔬菜批发市场, 广西柳州柳邕农副产品批发市场, 广西田阳县果蔬菜批发市场),List(14, 14, 12))
(List(宁夏),List(宁夏吴忠市利通区东郊果蔬批发市场),List(16))
(List(甘肃),List(甘肃酒泉春光农产品市场有限责任公司, 甘肃省武山县洛门蔬菜批发市场, 甘肃陇西县清吉洋芋批发市场),List(17, 14, 13))
(List(湖北),List(湖北省黄石市农副产品批发交易公司, 湖北武汉白沙洲农副产品大市场, 武汉市皇经堂批发市场),List(16, 14, 10))
(List(江西),List(江西省永丰县农产品批发中心市场),List(15))
(List(山东),List(山东青岛平度市南村蔬菜批发市场, 山东青岛李沧区沧口蔬菜副食品, 山东济南市堤口路果品批发市场),List(15, 14, 14))
(List(江苏),List(江苏省南京市惠民桥农副产品市场, 江苏苏州南环桥农副产品批发市, 江苏常州宣塘桥水产品交易市场),List(15, 14, 14))
(List(福建),List(福建福鼎闽浙边界农贸中心市场, 福州市闽江蔬菜贸易中心),List(14, 11))
(List(重庆),List(重庆江北区盘溪农贸市场),List(11))
(List(山西),List(山西晋城市绿盛农工商实业有限公司农副产品批发市场, 山西呂梁市离石区马茂庄常青蔬菜瓜果综合市场, 山西太原市城东利民果菜批发市场),List(24, 21, 15))
(List(四川),List(四川凉山州会东县堵格乡牲畜交易市场, 四川广安市邻水县农产品交易中心, 四川南充市桑园坝农产品批发市场),List(17, 15, 15))
(List(安徽),List(安徽安庆市龙狮桥蔬菜副食品批发交易市场, 安徽马鞍山安民农副产品批发交易市场, 安徽砀山农产品中心惠丰批发市场),List(19, 17, 15))
(List(),List(),List(0))
(List(河北),List(河北邯郸（魏县）天仙果品农贸批发交易市场, 河北怀来县就西果菜批发市场有限责任公司, 河北乐亭县冀东果蔬批发市场),List(20, 19, 13))
     */


  }
}
